const chartData = {
	metadata: {
		view: 'lineChart',
		title: 'Динамика прямых чистых потерь по последним пяти инцидентам',
		description:
			'График показывает динамику прямых чистых потерь по последним пяти инцидентам, сгруппированным по дате обнаружения.',
		categories: ['2025-10-23', '2025-10-22', '2025-10-15'],
		series: ['Прямые чистые потери'],
		units: { x: 'дата', y: 'рубли' },
		axes: { x: 'Дата обнаружения', y: 'Прямые чистые потери' },
	},
	data: [
		{
			category: '2025-10-15',
			values: { 'Прямые чистые потери': 10001 },
		},
		{
			category: '2025-10-22',
			values: { 'Прямые чистые потери': 2460 },
		},
		{
			category: '2025-10-23',
			values: { 'Прямые чистые потери': 1120 },
		},
	],
};

const chartData1 = {
	metadata: {
		view: 'lineChart',
		title: 'Динамика прямых чистых потерь по последним 50 инцидентам',
		description:
			'График показывает динамику прямых чистых потерь по последним 50 инцидентам, сгруппированным по дате регистрации. Ось X отображает даты регистрации, а ось Y - величину прямых чистых потерь.',
		categories: [],
		series: ['Данные'],
		units: { x: '', y: 'рубли' },
		axes: { x: 'Дата регистрации инцидента', y: 'Прямые чистые потери' },
	},
	data: [
		{
			category: '2025-01-31',
			values: { Данные: 763532.19 },
		},
		{
			category: '2025-02-03',
			values: { Данные: 900 },
		},
		{
			category: '2025-02-13',
			values: { Данные: 444123 },
		},
		{
			category: '2025-02-21',
			values: { Данные: 102.14 },
		},
		{
			category: '2025-03-05',
			values: { Данные: 123 },
		},
		{
			category: '2025-04-08',
			values: { Данные: 0 },
		},
		{
			category: '2025-04-14',
			values: { Данные: 11 },
		},
		{
			category: '2025-05-06',
			values: { Данные: 0 },
		},
		{
			category: '2025-06-05',
			values: { Данные: 40128.2 },
		},
		{
			category: '2025-06-19',
			values: { Данные: 12111233 },
		},
		{
			category: '2025-06-25',
			values: { Данные: 0 },
		},
		{
			category: '2025-07-02',
			values: { Данные: 1248581 },
		},
		{
			category: '2025-07-07',
			values: { Данные: 12345 },
		},
		{
			category: '2025-07-08',
			values: { Данные: 520057 },
		},
		{
			category: '2025-07-16',
			values: { Данные: 411236.2 },
		},
		{
			category: '2025-07-17',
			values: { Данные: 12461322 },
		},
		{
			category: '2025-07-18',
			values: { Данные: 679879 },
		},
		{
			category: '2025-07-21',
			values: { Данные: 12345 },
		},
		{
			category: '2025-07-22',
			values: { Данные: 123463268 },
		},
		{
			category: '2025-08-06',
			values: { Данные: 8568 },
		},
		{
			category: '2025-08-07',
			values: { Данные: 0 },
		},
		{
			category: '2025-08-08',
			values: { Данные: 20562 },
		},
		{
			category: '2025-08-13',
			values: { Данные: 555555 },
		},
		{
			category: '2025-08-15',
			values: { Данные: 1000000 },
		},
		{
			category: '2025-08-28',
			values: { Данные: 0 },
		},
		{
			category: '2025-09-10',
			values: { Данные: 2342342344 },
		},
		{
			category: '2025-09-11',
			values: { Данные: 8568 },
		},
		{
			category: '2025-09-15',
			values: { Данные: 8568 },
		},
		{
			category: '2025-09-17',
			values: { Данные: 44 },
		},
		{
			category: '2025-10-07',
			values: { Данные: 1000 },
		},
		{
			category: '2025-10-15',
			values: { Данные: 10111 },
		},
		{
			category: '2025-10-22',
			values: { Данные: 2460 },
		},
		{
			category: '2025-10-23',
			values: { Данные: 1120 },
		},
	],
};

const chartData2 = {
	metadata: {
		view: 'pieChart',
		title: 'Распределение прямых чистых потерь по последним пяти инцидентам',
		description:
			'Диаграмма показывает распределение прямых чистых потерь по последним пяти инцидентам',
		categories: ['EVE-2174', 'EVE-2150', 'EVE-2149', 'EVE-2148', 'EVE-2147'],
		series: ['Прямые чистые потери'],
		units: { x: '', y: 'рублей' },
		axes: { x: 'Идентификатор', y: 'Прямые чистые потери' },
	},
	data: [
		{
			category: 'EVE-2147',
			values: { 'Прямые чистые потери': 9999 },
		},
		{
			category: 'EVE-2148',
			values: { 'Прямые чистые потери': 2 },
		},
		{
			category: 'EVE-2149',
			values: { 'Прямые чистые потери': 1230 },
		},
		{
			category: 'EVE-2150',
			values: { 'Прямые чистые потери': 1230 },
		},
		{
			category: 'EVE-2174',
			values: { 'Прямые чистые потери': 1120 },
		},
	],
};

const chartData3 = {
	metadata: {
		view: 'pieChart',
		title: 'Структура прямых чистых потерь по типам инцидентов',
		description: 'Визуализация данных',
		categories: [],
		series: ['Данные'],
		units: { x: '', y: '' },
		axes: { x: 'Категории', y: 'Значения' },
	},
	data: [
		{
			category: 'Возврат средств и компенсации клиентам по продуктам',
			values: { Данные: 141612 },
		},
		{
			category: 'Вывод средств из бизнеса заемщиком. Прочее',
			values: { Данные: 2829 },
		},
		{
			category:
				'Компрометация данных и мошенничество в удаленных каналах. Некорректное функционирование систем',
			values: { Данные: 47743 },
		},
		{
			category:
				'Недобросовестные практики продаж продуктов и услуг. Мисинформинг - искажение и/или представление клиенту неполной информации о продукте/услуге',
			values: { Данные: 511489 },
		},
		{
			category: 'Недобросовестные практики продаж продуктов и услуг. Прочее',
			values: { Данные: 123 },
		},
		{
			category: 'Некорректное взимание процентов. Недоступность АС /ФП',
			values: { Данные: 123 },
		},
		{
			category:
				'Некорректное взимание процентов. Некорректный ввод параметров продукта в АС',
			values: { Данные: 123 },
		},
		{
			category: 'Повреждение / утрата имущества',
			values: { Данные: 2190155 },
		},
		{
			category:
				'Повреждение / утрата имущества. Вандальные действия третьих лиц',
			values: { Данные: 65449.38 },
		},
		{
			category: 'Хищение средств со счетов третьими лицами',
			values: { Данные: 4311753 },
		},
		{
			category:
				'Хищение средств со счетов третьими лицами. Недостатки процесса выявления и проставления маркера в профиле клиента',
			values: { Данные: 5532.58 },
		},
		{
			category: 'Штрафные санкции',
			values: { Данные: 9639 },
		},
		{
			category: 'Штрафные санкции. Нарушение законодательства о конкуренции',
			values: { Данные: 272 },
		},
		{
			category: 'Штрафные санкции. Нарушение правил платежных систем',
			values: { Данные: 131.75 },
		},
	],
};

const chartData4 = {
	metadata: {
		view: 'barChart',
		title: 'Последние 5 найденных инцидента с потерями',
		description:
			'График отображает последние 5 найденных инцидента с потерями, где по оси X указаны идентификаторы инцидентов, а по оси Y - прямые чистые потери.',
		categories: ['EVE-2174', 'EVE-2156', 'EVE-2150', 'EVE-2157', 'EVE-2149'],
		series: ['Прямые чистые потери'],
		units: { x: '', y: 'рублей' },
		axes: { x: 'Идентификатор инцидента', y: 'Прямые чистые потери' },
	},
	data: [
		{
			category: 'EVE-2149',
			values: { 'Прямые чистые потери': 1230 },
		},
		{
			category: 'EVE-2150',
			values: { 'Прямые чистые потери': 1230 },
		},
		{
			category: 'EVE-2156',
			values: { 'Прямые чистые потери': 1230 },
		},
		{
			category: 'EVE-2157',
			values: { 'Прямые чистые потери': 3 },
		},
		{
			category: 'EVE-2174',
			values: { 'Прямые чистые потери': 1120 },
		},
	],
};

const chartData5 = {
	metadata: {
		view: 'lineChart',
		title: 'Наибольшие потери по каждому ЦПР в 2025 году',
		description:
			'График показывает месяцы с наибольшими потерями по каждому типу ЦПР в 2025 году. Ось X отображает типы ЦПР, а ось Y - сумму прямых чистых потерь. Каждая линия соответствует определённому месяцу.',
		categories: [
			'Внутреннее мошенничество с целью получения выгоды',
			'Повреждение / утрата имущества',
			'Компрометация данных и мошенничество в удаленных каналах',
			'Хищение средств со счетов третьими лицами',
			'Недобросовестные практики продаж продуктов и услуг',
			'Возврат средств и компенсации клиентам по продуктам',
			'Не оказаны или некачественно оказаны услуги третьим лицом',
			'Излишние выплаты сотрудникам',
			'Некорректное списание средств',
			'Штрафные санкции',
			'Вывод средств из бизнеса заемщиком',
			'Компенсации сотрудникам за необоснованное увольнение',
		],
		series: [
			'2025-01',
			'2025-02',
			'2025-03',
			'2025-04',
			'2025-05',
			'2025-06',
			'2025-07',
			'2025-08',
			'2025-09',
			'2025-10',
		],
		units: { x: '', y: 'рубли' },
		axes: { x: 'Тип ЦПР', y: 'Сумма прямых чистых потерь' },
	},
	data: [
		{
			category: 'Внутреннее мошенничество с целью получения выгоды',
			values: {
				'2025-01': 0.0,
				'2025-02': 444123.0,
				'2025-03': 0.0,
				'2025-04': 11.0,
				'2025-05': 0.0,
				'2025-06': 0.0,
				'2025-07': 12486012.0,
				'2025-08': 0.0,
				'2025-09': 2342342343.0,
				'2025-10': 4582.0,
			},
		},
		{
			category: 'Возврат средств и компенсации клиентам по продуктам',
			values: {
				'2025-01': 0.0,
				'2025-02': 0.0,
				'2025-03': 0.0,
				'2025-04': 0.0,
				'2025-05': 0.0,
				'2025-06': 0.0,
				'2025-07': 568768.0,
				'2025-08': 0.0,
				'2025-09': 44.0,
				'2025-10': 0.0,
			},
		},
		{
			category: 'Вывод средств из бизнеса заемщиком',
			values: {
				'2025-01': 0.0,
				'2025-02': 0.0,
				'2025-03': 0.0,
				'2025-04': 0.0,
				'2025-05': 0.0,
				'2025-06': 0.0,
				'2025-07': 0.0,
				'2025-08': 0.0,
				'2025-09': 0.0,
				'2025-10': 9999.0,
			},
		},
		{
			category: 'Излишние выплаты сотрудникам',
			values: {
				'2025-01': 0.99,
				'2025-02': 0.0,
				'2025-03': 0.0,
				'2025-04': 0.0,
				'2025-05': 0.0,
				'2025-06': 0.0,
				'2025-07': 111111.0,
				'2025-08': 20561.0,
				'2025-09': 0.0,
				'2025-10': 0.0,
			},
		},
		{
			category: 'Компенсации сотрудникам за необоснованное увольнение',
			values: {
				'2025-01': 0.0,
				'2025-02': 0.0,
				'2025-03': 0.0,
				'2025-04': 0.0,
				'2025-05': 0.0,
				'2025-06': 0.0,
				'2025-07': 1234.0,
				'2025-08': 0.0,
				'2025-09': 0.0,
				'2025-10': 110.0,
			},
		},
		{
			category: 'Компрометация данных и мошенничество в удаленных каналах',
			values: {
				'2025-01': 0.0,
				'2025-02': 0.0,
				'2025-03': 0.0,
				'2025-04': 0.0,
				'2025-05': 0.0,
				'2025-06': 12111233.0,
				'2025-07': 0.0,
				'2025-08': 0.0,
				'2025-09': 0.0,
				'2025-10': 0.0,
			},
		},
		{
			category: 'Не оказаны или некачественно оказаны услуги третьим лицом',
			values: {
				'2025-01': 0.0,
				'2025-02': 0.0,
				'2025-03': 0.0,
				'2025-04': 0.0,
				'2025-05': 0.0,
				'2025-06': 0.0,
				'2025-07': 410003.0,
				'2025-08': 0.0,
				'2025-09': 0.0,
				'2025-10': 0.0,
			},
		},
		{
			category: 'Недобросовестные практики продаж продуктов и услуг',
			values: {
				'2025-01': 0.0,
				'2025-02': 102.14,
				'2025-03': 123.0,
				'2025-04': 0.0,
				'2025-05': 0.0,
				'2025-06': 0.0,
				'2025-07': 1742934.0,
				'2025-08': 0.0,
				'2025-09': 0.0,
				'2025-10': 0.0,
			},
		},
		{
			category: 'Некорректное списание средств',
			values: {
				'2025-01': 40006.0,
				'2025-02': 0.0,
				'2025-03': 0.0,
				'2025-04': 0.0,
				'2025-05': 0.0,
				'2025-06': 40129.0,
				'2025-07': 0.0,
				'2025-08': 0.0,
				'2025-09': 0.0,
				'2025-10': 0.0,
			},
		},
		{
			category: 'Повреждение / утрата имущества',
			values: {
				'2025-01': 0.0,
				'2025-02': 0.0,
				'2025-03': 0.0,
				'2025-04': 0.0,
				'2025-05': 0.0,
				'2025-06': 0.0,
				'2025-07': 123463268.0,
				'2025-08': 1555555.0,
				'2025-09': 0.0,
				'2025-10': 0.0,
			},
		},
		{
			category: 'Хищение средств со счетов третьими лицами',
			values: {
				'2025-01': 2934861.0,
				'2025-02': 900.0,
				'2025-03': 0.0,
				'2025-04': 0.0,
				'2025-05': 0.0,
				'2025-06': 0.0,
				'2025-07': 0.0,
				'2025-08': 0.0,
				'2025-09': 0.0,
				'2025-10': 0.0,
			},
		},
		{
			category: 'Штрафные санкции',
			values: {
				'2025-01': 21420.0,
				'2025-02': 0.0,
				'2025-03': 0.0,
				'2025-04': 0.0,
				'2025-05': 0.0,
				'2025-06': 0.0,
				'2025-07': 25704.0,
				'2025-08': 8568.0,
				'2025-09': 17136.0,
				'2025-10': 0.0,
			},
		},
	],
};

const chartData6 = {
	metadata: {
		view: 'pieChart',
		title: 'Соотношение прямых, косвенных и потенциальных потерь за 2025 год',
		description:
			'Круговая диаграмма показывает соотношение прямых, косвенных и потенциальных потерь по событиям за 2025 год. Данные представлены в рублях.',
		categories: ['Сводка'],
		series: ['Прямые потери', 'Косвенные потери', 'Потенциальные потери'],
		units: {
			x: '',
			y: 'рублей',
		},
		axes: {
			x: 'Тип потерь',
			y: 'Сумма потерь',
		},
	},
	data: [
		{
			category: 'Сводка',
			values: {
				'Прямые потери': 2493401893.55,
				'Косвенные потери': 1556269.35,
				'Потенциальные потери': 4837192.58,
			},
		},
	],
};
